# ProgressDlgSetMeter

## Description
Set progress meter message of a progress dialog.

```pascal
PROCEDURE ProgressDlgSetMeter(message : STRING);
```

```python

def vs.ProgressDlgSetMeter(message):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|message|STRING||

## Version
Availability: from Vectorworks 2015
## Category
* Utility